app/Controllers/MahasiswaController.php

SELECT *
FROM `data_mahasiswa`
ORDER BY `id` DESC
---
    public function dd(): string
    {

        $table = $this->mahasiswaModel->orderBy('id', 'DESC')->findAll();