app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT *
FROM `auth_groups`
---
    public function index()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();

        $groupModel = new GroupModel();

        foreach ($data['users'] as $row) {
            $dataRow['group'] = $groupModel->getGroupsForUser($row->id);
            $dataRow['row'] = $row;
            $data['row' . $row->id] = view('row', $dataRow);
        }

        $data['groups'] = $groupModel->findAll();

INSERT INTO `users` (`password_hash`, `reset_hash`, `reset_at`, `reset_expires`, `email`, `username`, `active`, `activate_hash`, `created_at`, `updated_at`) VALUES ('$2y$10$iPY0CX7crdnfedvtuv2abuIm5djzoZf7H5Cxcm8gri01w2yNML.im', NULL, NULL, NULL, 'bisa@bisa.com', 'admin', 1, NULL, '2024-01-14 16:47:16', '2024-01-14 16:47:16')
---
            $users = $users->withGroup($this->config->defaultUserGroup);
        }

        if (!$users->save($user)) {