app/Models/MahasiswaModel.php

SELECT COUNT(`nama_mahasiswa`) AS `nama_mahasiswa`
FROM `data_mahasiswa`
---
    public function hitungJumlahSemuaJuara()
    {
        return $this->selectCount('nama_mahasiswa')->get();

SELECT COUNT(`nama_lomba`) AS `nama_lomba`
FROM `data_mahasiswa`
---
    public function daftarLomba()
    {
        return $this->selectCount('nama_lomba')->get();