app/Models/UserModel.php

SELECT `id`
FROM `users`
WHERE `username` = 'gintama405'
 LIMIT 1
---
    public function findIdByUsername($username)
    {
        return $this->select('id')->where('username', $username)->first();